/*
Как добавлять новую планировку?
1. Её нужно поместить в GetCoordFrame
2. После того как мод был собран с этой версией pwn файла и залит на сервере
    - Зайти в игру, прописать /frame, нажать на плюсик в нижнем правом углу и добавить новую планировку + настроить её по цене, классу и названию

Откуда брать координаты для нового объекта?
- Задача поместить входную дверь нового интерьера в то-же самое место, где находится дверь всех интов
- Можно взять любые координаты существующего инта и подогнать под него
- Обязательно учитывать и высоту пола. Он должен совпадать со всеми интами
- Есть инты, у которых разный уровень пола. (Значит по высоте берём самую низкую точку этого инта и выравниваем, чтобы ребзи не ходили по воздуху)


Классы планировок:
    1 Класс - пиздатые (2 этажа доступно)
    2 Класс - нормульные (2 этажа доступно)
    3 Класс - так себе, и нормульные (только 1 этаж)
    4 Класс - бомжарные (только 1 этаж)
    5 Класс - это VIP интерьеры. Самые редкие, особые и пиздатые для VIP домов
*/


stock GetCoordFrame(model, &Float:x, &Float:y, &Float:z, &Float:rx, &Float:ry, &Float:rz)
{
	switch(model)
	{
	    case 14383: x = 1397.21204, y = -11.47380, z = 1001.63678, rx = 0.0, ry = 0.0, rz = 0.0;
        case 14700: x = 1387.45801, y = -13.35620, z = 1001.38879, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14701: x = 1387.79993, y = -7.24370, z = 1001.94879, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14702: x = 1384.75745, y = -4.22610, z = 1004.17279, rx = 0.0, ry = 0.0, rz = 0.0; // del
		case 14703: x = 1384.75745, y = -4.22610, z = 1004.17279, rx = 0.0, ry = 0.0, rz = 0.0; // del
		case 14706: x = 1387.23022, y = -5.04620, z = 1003.10083, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14708: x = 1388.52283, y = -8.21970, z = 1001.64478, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14709: x = 1388.31274, y = -7.26340, z = 1001.34882, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14710: x = 1390.65588, y = -7.99060, z = 1001.38879, rx = 0.0, ry = 0.0, rz = -90.0;
		case 14711: x = 1379.99524, y = -8.19280, z = 1001.48480, rx = 0.0, ry = 0.0, rz = -90.0;
		case 14712: x = 1384.47095, y = -10.03630, z = 1001.46082, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14713: x = 1382.28357, y = -12.45890, z = 1001.68481, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14714: x = 1387.45776, y = -9.49160, z = 1001.68481, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14717: x = 1393.30396, y = -14.63810, z = 1001.68481, rx = 0.0, ry = 0.0, rz = -90.0; // del
		case 14718: x = 1384.42053, y = -12.70110, z = 999.88483, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14735: x = 1403.91565, y = -10.20290, z = 1001.50079, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14736: x = 1389.02234, y = -29.56740, z = 1000.99683, rx = 0.0, ry = 0.0, rz = -90.0;
		case 14748: x = 1388.97705, y = -12.33400, z = 1001.86877, rx = 0.0, ry = 0.0, rz = -90.0;
		case 14750: x = 1390.74316, y = -8.10590, z = 1006.38080, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14754: x = 1390.12756, y = -8.33940, z = 1003.82080, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14755: x = 1387.61084, y = -24.77320, z = 1001.12482, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14756: x = 1387.44299, y = -16.69400, z = 1001.86877, rx = 0.0, ry = 0.0, rz = -90.0;
		case 14758: x = 1386.68835, y = -17.50410, z = 1001.74878, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14759: x = 1394.71826, y = -8.18120, z = 1006.38080, rx = 0.0, ry = 0.0, rz = -90.0;
		case 14760: x = 1380.17383, y = -13.65150, z = 1001.87677, rx = 0.0, ry = 0.0, rz = -90.0;
		case 15041: x = 1378.75610, y = -12.53260, z = 1001.87677, rx = 0.0, ry = 0.0, rz = 180.0;
		case 15053: x = 1387.42786, y = -20.76250, z = 1001.12482, rx = 0.0, ry = 0.0, rz = 180.0;
		case 15054: x = 1378.64929, y = -4.77060, z = 1003.34082, rx = 0.0, ry = 0.0, rz = -90.0;
		case 15055: x = 1383.94543, y = -8.86860, z = 1001.12482, rx = 0.0, ry = 0.0, rz = 180.0;
		case 15058: x = 1391.23584, y = -8.33160, z = 1003.81281, rx = 0.0, ry = 0.0, rz = 0.0;
		
		//Новые Каркасы в Дома:
		case 14707: x = 1399.815795, y = -2.517479, z = 1004.482421, rx = 0.0, ry = 0.0, rz = 0.0;
		case 15029: x = 1389.115966, y = -11.871783, z = 1001.638732, rx = 0.0, ry = 0.0, rz = 90.0;
		case 15031: x = 1384.468017, y = -12.434522, z = 999.887207, rx = 0.0, ry = 0.0, rz = 0.0;
		case 15033: x = 1391.161865, y = -4.696370, z = 999.883605, rx = 0.0, ry = 0.0, rz = -90.0;
		case 15034: x = 1387.022094, y = -12.765852, z = 1001.637207, rx = 0.0, ry = 0.0, rz = 0.0;
		case 15046: x = 1387.462768, y = -24.683084, z = 1001.138305, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14534: x = 1393.365966, y = -14.903064, z = 1004.514038, rx = 0.0, ry = 0.0, rz = 180.0;

		//Каркасы в Бизнесы:
		case 14665: x = 1387.420654, y = -11.789448, z = 1001.873229, rx = 0.0, ry = 0.0, rz = 90.0; // ДЕФОЛТНЫЙ, КОТОРЫЙ СТОИТ ВО ВСЕХ
		case 14667: x = 1387.569458, y = -13.958979, z = 1001.872436, rx = 0.0, ry = 0.0, rz = -270.0;
		case 14670: x = 1387.425170, y = -11.801514, z = 1001.873474, rx = 0.0, ry = 0.0, rz = 90.0;
		case 14668: x = 1387.496215, y = -6.728766, z = 999.888061, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14669: x = 1387.507812, y = -6.691575, z = 999.888061, rx = 0.0, ry = 0.0, rz = 0.0;
		case 14672: x = 1379.864624, y = -8.144284, z = 1001.889892, rx = 0.0, ry = 0.0, rz = 0.0; // sex shop
		case 14531: x = 1383.062866, y = -5.476271, z = 1003.505371, rx = 0.0, ry = 0.0, rz = 90.0; // zero shop
		case 14530: x = 1389.376342, y = -5.370576, z = 1001.674438, rx = 0.0, ry = 0.0, rz = 180.0; // автошкола sf
		case 18030: x = 1392.550415, y = -3.754338, z = 1002.256896, rx = 0.0, ry = 0.0, rz = 0.0; // просторный белый
		case 18028: x = 1389.548950, y = -6.673306, z = 1002.075561, rx = 0.0, ry = 0.0, rz = 180.0; // байкерский бар
		case 18056: x = 1390.507080, y = -3.279683, z = 1001.675964, rx = 0.0, ry = 0.0, rz = -90.0; // закусочная стрёмненькая
		case 14785: x = 1385.088134, y = -9.294095, z = 1001.862915, rx = 0.0, ry = 0.0, rz = 270.0; // ставить ставки
		case 18082: x = 1388.353881, y = -11.693702, z = 1002.158630, rx = 0.0, ry = 0.0, rz = 0.0; // маленькая парикмахерская
		case 18027: x = 1387.479614, y = -13.766748, z = 1002.027343, rx = 0.0, ry = 0.0, rz = 0.0; // маленькая парикмахерская 2
		case 18020: x = 1387.847045, y = -4.587465, z = 1001.888488, rx = 0.0, ry = 0.0, rz = 45.0; // burger shot угловой
		case 18045: x = 1381.721557, y = -12.833935, z = 1001.888671, rx = 0.0, ry = 0.0, rz = 0.0; // оруженый магаз или мой морской
		case 18024: x = 1389.823364, y = -7.529106, z = 1003.047912, rx = 0.0, ry = 0.0, rz = 0.0; // магаз с одеждой sub urban
		case 18022: x = 1395.183105, y = -12.178796, z = 1001.827209, rx = 0.0, ry = 0.0, rz = 0.0; // cluckin bell маленький из sf
		case 18026: x = 1387.402587, y = -9.458990, z = 1000.028198, rx = 0.0, ry = 0.0, rz = 0.0; // магаз с одежой простой
		case 18023: x = 1388.793823, y = -6.625020, z = 1002.009765, rx = 0.0, ry = 0.0, rz = 0.0; // pizza co из гетто
		case 18021: x = 1387.761230, y = -9.838519, z = 1002.018127, rx = 0.0, ry = 0.0, rz = 0.0; // donuts закусочная
		case 14738: x = 1395.444213, y = -13.353138, z = 1002.508544, rx = 0.0, ry = 0.0, rz = 0.0; // дешевый розовый бордель (ресторан или клуб)
		case 14488: x = 1379.986083, y = -6.786745, z = 1002.318603, rx = 0.0, ry = 0.0, rz = 0.0; // спортзал (ресторан или клуб)
		case 14588: x = 1364.491333, y = -0.649488, z = 1003.790527, rx = 0.0, ry = 0.0, rz = 270.0; // свинорезка огромная (ресторан или клуб)
		case 14853: x = 1414.056274, y = 12.572878, z = 1005.035095, rx = 0.0, ry = 0.0, rz = 0.0; // самый большой кусок sfpd (ресторан или клуб)
		case 14808: x = 1388.273315, y = -10.203638, z = 1001.315551, rx = 0.0, ry = 0.0, rz = 180.0; // маленький стриптиз (ресторан или клуб)
		case 14815: x = 1388.817993, y = -5.850437, z = 1001.673889, rx = 0.0, ry = 0.0, rz = 270.0; // бордель (ресторан или клуб)
		case 14838: x = 1394.957153, y = -5.510683, z = 1001.434143, rx = 0.0, ry = 0.0, rz = 0.0; // средний стриптиз (ресторан или клуб)
		case 18018: x = 1387.457885, y = -2.945837, z = 999.885131, rx = 0.0, ry = 0.0, rz = 180.0; // alhambra (ресторан или клуб)
		case 14789: x = 1367.823486, y = 7.070006, z = 1004.124450, rx = 0.0, ry = 0.0, rz = 0.0; // спортзал sf (ресторан или клуб)
		case 14777: x = 1387.443725, y = -2.773496, z = 999.888061, rx = 0.0, ry = 0.0, rz = 180.0; // маленькое казино (ресторан или клуб)
		case 14794: x = 1380.002929, y = -6.574307, z = 1002.327819, rx = 0.0, ry = 0.0, rz = 0.0; // спортзал lv (ресторан или клуб)

		// Детали каркаса Jizzy
		case 14536: x = 1366.405761, y = -9.411747, z = 1016.865722, rx = 0.0, ry = 0.0, rz = 0.0; // 1 этаж
		case 14546: x = 1366.405639, y = -9.408047, z = 1016.865051, rx = 0.0, ry = 0.0, rz = 0.0; // 2 Этаж
		case 14533: x = 1366.405395, y = -9.408463, z = 1016.863159, rx = 0.0, ry = 0.0, rz = 0.0; // Крыша
		case 14559: x = 1366.416992, y = -9.402415, z = 1016.880432, rx = 0.0, ry = 0.0, rz = 0.0; // Лампы
		case 14547: x = 1366.399169, y = -9.228580, z = 1016.756347, rx = 0.0, ry = 0.0, rz = 0.0; // Балконы и украшения
		case 14539: x = 1367.140380, y = -1.730533, z = 1008.311218, rx = 0.0, ry = 0.0, rz = 0.0; // Неоновые вывески
		case 14540: x = 1373.554809, y = -4.100122, z = 1000.507629, rx = 0.0, ry = 0.0, rz = 90.0; // Диваны
		case 14537: x = 1365.023071, y = -8.790015, z = 1001.836059, rx = 0.0, ry = 0.0, rz = 0.0; // Барная стойка

		// Custom Interior 12169
		case 12169: x = 1392.212158, y = -11.385623, z = 1003.337585, rx = 0.0, ry = 0.0, rz = -90.0; // Основной инт
		case 12170: x = 1392.212158, y = -11.386466, z = 1003.336059, rx = 0.0, ry = 0.0, rz = -90.0; // Перила и окна

		// Custom Interior 12488
		case 12488: x = 1398.843872, y = -16.868043, z = 1003.521728, rx = 0.000000, ry = 0.000000, rz = 180.000000; // Треугольный, коричневый инт

		// Custom Interior 12360 зверь сделал
		case 12360: x = 1378.149291, y = -1.029935, z = 1003.975646, rx = 0.000000, ry = 0.000000, rz = 90.000000;
		
		default: x = 0.0, y = 0.0, z = 0.0, rx = 0.0, ry = 0.0, rz = 0.0;
	}
    return 1;
}

// Если каркас требует второй объект
stock IsASecondObject(model)
{
	if(model == 12169) return 12170; // ID объекта, который привязан к планировке (исключение для этой шляпы)
	return 0;
}

// Сколько объектов используется у планировки
stock IsAQuanInterior(model)
{
	if(model == 14536) return 8; // У этой планировки 8 объектов
	else if(model == 12169) return 2; // У этой планировки 2 объекта
	return 1; // Все остальные 1 объект
}



// Проверка на то, что объект является рюкзаком
stock IsABackPack(AksId)
{
    if(AksId == 12104 || (AksId >= 12114 && AksId <= 12133) || AksId == 12171 || AksId == 12172 || AksId == 12137 
    || (AksId >= 12175 && AksId <= 12195) || AksId == 12331 || AksId == 12348 || (AksId >= 12367 && AksId <= 12373) 
    || AksId == 12407 || (AksId >= 12473 && AksId <= 12478) || GetBustAksType(AksId) == 1) return true;
    else return false;
}


/*
Musk: это я оставил для себя..

Новые Каркасы в Дома:
CreateDynamicObject(14707, 1399.815795, -2.517479, 1004.482421, 0.00000, 0.00000, 0.00000, d+1000, 90, -1, 100.00, 100.00);
CreateDynamicObject(15029, 1389.115966, -11.871783, 1001.638732, 0.000000, 0.000000, 90.000000, object_world, object_int, -1, 300.00, 300.00);
CreateDynamicObject(15031, 1384.468017, -12.434522, 999.887207, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
CreateDynamicObject(15033, 1391.161865, -4.696370, 999.883605, 0.000000, 0.000000, -90.000000, object_world, object_int, -1, 300.00, 300.00);
CreateDynamicObject(15034, 1387.022094, -12.765852, 1001.637207, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
CreateDynamicObject(15046, 1387.462768, -24.683084, 1001.138305, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
CreateDynamicObject(14534, 1393.365966, -14.903064, 1004.514038, 0.000000, 0.000000, 180.000000, object_world, object_int, -1, 300.00, 300.00);

Каркасы в Бизнесы:
CreateDynamicObject(14665, 1387.420654, -11.789448, 1001.873229, 0.000000, 0.000000, 90.000000, object_world, object_int, -1, 300.00, 300.00); // ДЕФОЛТНЫЙ, КОТОРЫЙ СТОИТ ВО ВСЕХ
CreateDynamicObject(14667, 1387.569458, -13.958979, 1001.872436, 0.000000, 0.000000, -270.000000, object_world, object_int, -1, 300.00, 300.00);
CreateDynamicObject(14670, 1387.425170, -11.801514, 1001.873474, 0.000000, 0.000000, 90.000000, object_world, object_int, -1, 300.00, 300.00);
CreateDynamicObject(14668, 1387.496215, -6.728766, 999.888061, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
CreateDynamicObject(14669, 1387.507812, -6.691575, 999.888061, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
CreateDynamicObject(14672, 1379.864624, -8.144284, 1001.889892, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // sex shop
CreateDynamicObject(14531, 1383.062866, -5.476271, 1003.505371, 0.000000, 0.000000, 90.000000, object_world, object_int, -1, 300.00, 300.00); // zero shop
CreateDynamicObject(14530, 1389.376342, -5.370576, 1001.674438, 0.000000, 0.000000, 180.000000, object_world, object_int, -1, 300.00, 300.00); // автошкола sf
CreateDynamicObject(18030, 1392.550415, -3.754338, 1002.256896, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // просторный белый
CreateDynamicObject(18028, 1389.548950, -6.673306, 1002.075561, 0.000000, 0.000000, 180.000000, object_world, object_int, -1, 300.00, 300.00); // байкерский бар
CreateDynamicObject(18056, 1390.507080, -3.279683, 1001.675964, 0.000000, 0.000000, -90.000000, object_world, object_int, -1, 300.00, 300.00); // закусочная стрёмненькая
CreateDynamicObject(14785, 1385.088134, -9.294095, 1001.862915, 0.000000, 0.000000, 270.000000, object_world, object_int, -1, 300.00, 300.00); // ставить ставки
CreateDynamicObject(18082, 1388.353881, -11.693702, 1002.158630, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // маленькая парикмахерская
CreateDynamicObject(18027, 1387.479614, -13.766748, 1002.027343, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // маленькая парикмахерская 2
CreateDynamicObject(18020, 1387.847045, -4.587465, 1001.888488, 0.000000, 0.000000, 45.000000, object_world, object_int, -1, 300.00, 300.00); // burger shot угловой
CreateDynamicObject(18045, 1381.721557, -12.833935, 1001.888671, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // оруженый магаз или мой морской
CreateDynamicObject(18024, 1389.823364, -7.529106, 1003.047912, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // магаз с одеждой sub urban
CreateDynamicObject(18022, 1395.183105, -12.178796, 1001.827209, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // cluckin bell маленький из sf
CreateDynamicObject(18026, 1387.402587, -9.458990, 1000.028198, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // магаз с одежой простой
CreateDynamicObject(18023, 1388.793823, -6.625020, 1002.009765, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // pizza co из гетто
CreateDynamicObject(18021, 1387.761230, -9.838519, 1002.018127, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // donuts закусочная
CreateDynamicObject(14738, 1395.444213, -13.353138, 1002.508544, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // дешевый розовый бордель (ресторан или клуб)
CreateDynamicObject(14488, 1379.986083, -6.786745, 1002.318603, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // спортзал (ресторан или клуб)
CreateDynamicObject(14588, 1364.491333, -0.649488, 1003.790527, 0.000000, 0.000000, 270.000000, object_world, object_int, -1, 300.00, 300.00); // свинорезка огромная (ресторан или клуб)
CreateDynamicObject(14853, 1414.056274, 12.572878, 1005.035095, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // самый большой кусок sfpd (ресторан или клуб)
CreateDynamicObject(14808, 1388.273315, -10.203638, 1001.315551, 0.000000, 0.000000, 180.000000, object_world, object_int, -1, 300.00, 300.00); // маленький стриптиз (ресторан или клуб)
CreateDynamicObject(14815, 1388.817993, -5.850437, 1001.673889, 0.000000, 0.000000, 270.000000, object_world, object_int, -1, 300.00, 300.00); // бордель (ресторан или клуб)
CreateDynamicObject(14838, 1394.957153, -5.510683, 1001.434143, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // средний стриптиз (ресторан или клуб)
CreateDynamicObject(18018, 1387.457885, -2.945837, 999.885131, 0.000000, 0.000000, 180.000000, object_world, object_int, -1, 300.00, 300.00); // alhambra (ресторан или клуб)
CreateDynamicObject(14789, 1367.823486, 7.070006, 1004.124450, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // спортзал sf (ресторан или клуб)
CreateDynamicObject(14777, 1387.443725, -2.773496, 999.888061, 0.000000, 0.000000, 180.000000, object_world, object_int, -1, 300.00, 300.00); // маленькое казино (ресторан или клуб)
CreateDynamicObject(14794, 1380.002929, -6.574307, 1002.327819, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00); // спортзал lv (ресторан или клуб)

// Детали каркаса Jizzy
tmpobjid = CreateDynamicObject(14536, 1366.405761, -9.411747, 1016.865722, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
tmpobjid = CreateDynamicObject(14546, 1366.405639, -9.408047, 1016.865051, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
tmpobjid = CreateDynamicObject(14533, 1366.405395, -9.408463, 1016.863159, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
tmpobjid = CreateDynamicObject(14559, 1366.416992, -9.402415, 1016.880432, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
tmpobjid = CreateDynamicObject(14547, 1366.399169, -9.228580, 1016.756347, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
tmpobjid = CreateDynamicObject(14539, 1367.140380, -1.730533, 1008.311218, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
tmpobjid = CreateDynamicObject(14540, 1373.554809, -4.100122, 1000.507629, 0.000000, 0.000000, 90.000000, object_world, object_int, -1, 300.00, 300.00);
tmpobjid = CreateDynamicObject(14537, 1365.023071, -8.790015, 1001.836059, 0.000000, 0.000000, 0.000000, object_world, object_int, -1, 300.00, 300.00);
*/
