#define SECOND_FOR_BACK_VILLAGE         300 // Время на возвращение ботов деревенских после того как их всех убили
#define CD_GIFT_VILLAGE                 3600 // Кд, через которое подарки можно будет получить, убив всех ботов
#define RESPAWN_VILLAGE_NPC             210 // Время респавна для NPC
#define VILLAGE_SWITCH_ATTACK_CD        3 // Время (в секундах), как часто NPC будет менять цель атаки, когда в него стреляет другой игрок

// -- Начисление призов --
#define VILLAGE_BASE_CASE_REWARD        1 // Базовое количество шкатулок за первые X киллов
#define VILLAGE_KILLS_PER_REWARD        5 // Количество убийств для получения указанного количества шкатулок
#define VILLAGE_DECREASE_REWARD_FACTOR  0.75 // Коэффициент уменьшения награды за каждый последующий набор киллов

new Iterator:VillagePlayer<MAX_PLAYERS>;

enum VILLAGENPCWALK { Float:WalkStart_X, Float:WalkStart_Y, Float:WalkStart_Z, Float:WalkStop_X, Float:WalkStop_Y, Float:WalkStop_Z }
new VillageNpcWalk[][VILLAGENPCWALK] =
{
	{-1411.0293, 2660.7769, 55.6875,  -1410.6873, 2650.2354, 55.6875},
    {-1410.6155, 2634.8545, 55.6875,  -1410.5419, 2625.4497, 55.6875},
    {-1389.8745, 2626.7554, 55.9844,  -1390.0033, 2637.2410, 55.9844},
    {-1418.5422, 2661.2385, 55.8360,  -1418.2983, 2645.9797, 55.6918},
    {-1418.3035, 2635.3799, 55.7307,  -1418.2275, 2622.2549, 55.8360},
    {-1417.2065, 2593.3708, 55.7713,  -1426.9941, 2593.7834, 55.8360},
    {-1432.6042, 2588.5288, 55.8360,  -1432.2854, 2576.7224, 55.8360},
    {-1437.0166, 2593.9033, 55.8360,  -1451.7305, 2593.7996, 55.8360},
    {-1446.6251, 2590.0430, 55.8360,  -1446.6166, 2572.8728, 55.8360},
    {-1450.8912, 2570.3516, 55.8360,  -1464.3019, 2570.5117, 55.8360},
    {-1464.2180, 2578.0676, 55.8360,  -1464.1276, 2591.6167, 55.8360},
    {-1468.2787, 2593.8853, 55.8360,  -1483.0529, 2593.8728, 55.8360},
    {-1488.2031, 2591.4143, 55.8360,  -1488.1381, 2577.9285, 55.8360},
    {-1498.6754, 2544.2625, 55.8360,  -1509.2627, 2544.0015, 55.7945},
    {-1521.6357, 2543.7986, 55.7243,  -1536.5270, 2543.5974, 55.8360},
    {-1531.2131, 2536.0376, 55.6875,  -1521.7983, 2535.9451, 55.6875},
    {-1509.9193, 2536.3228, 55.6875,  -1497.4003, 2536.8428, 55.6875},
    {-1496.9728, 2521.4443, 55.8562,  -1511.9117, 2521.3542, 55.8595},
    {-1519.3333, 2521.5635, 55.8535,  -1530.3545, 2521.4146, 55.9611},
    {-1532.5807, 2524.6685, 55.8532,  -1532.6233, 2536.3665, 55.6875},
    {-1553.9069, 2563.6563, 55.8360,  -1554.0684, 2583.5010, 55.8360},
    {-1553.4117, 2597.4832, 55.8360,  -1553.4445, 2626.9785, 55.8360},
    {-1552.4143, 2641.3040, 55.8360,  -1552.3186, 2654.6694, 55.8360},
    {-1563.2728, 2677.8359, 55.6831,  -1563.2555, 2691.6755, 55.7131},
    {-1547.3293, 2678.8125, 55.8360,  -1529.4081, 2678.8774, 55.8360},
    {-1527.5031, 2690.1328, 55.8360,  -1515.0317, 2690.0037, 55.8360},
    {-1499.5742, 2695.8564, 55.8360,  -1484.6726, 2695.5239, 55.8360},
    {-1476.2384, 2695.8105, 55.8018,  -1475.9655, 2684.8779, 55.6572},
    {-1474.9094, 2678.5396, 55.6826,  -1464.4270, 2678.7341, 55.8360},
    {-1455.1028, 2677.9177, 55.8360,  -1444.1818, 2677.7339, 55.8360},
    {-1434.5916, 2657.8809, 55.8360,  -1434.4617, 2643.8269, 55.8360},
    {-1434.3218, 2632.9512, 55.8360,  -1434.2684, 2617.5801, 55.8360},
    {-1441.2455, 2607.4819, 55.8360,  -1457.4935, 2607.6003, 55.8360},
    {-1459.5941, 2610.4199, 55.8360,  -1459.6425, 2629.1846, 58.7735},
    {-1478.5573, 2609.8618, 55.8360,  -1489.8650, 2610.1265, 55.8360}
};

new VillageRandomWeapons[] = { 4, 6, 9, 9, 25, 26, 30, 30, 30, 30 };
new VillageRandomSkins[] = { 1, 15, 32, 33, 34, 95, 128, 132, 133, 134, 136, 158, 159, 160, 161, 162, 183, 200, 202, 234, 235, 236 };

enum VILLAGEINFO
{
	NPC:villID[sizeof(VillageNpcWalk)], // ID бота
    bool:villActive, // Статус активна ли битва (боты агрессивные или нет)
    villRespawn[sizeof(VillageNpcWalk)], // Время, через которое бот заспавнится
    villZone, // Динамическая зона деревни
    villAttackPlayerid[sizeof(VillageNpcWalk)], // ID игрока, которого атакует бот
    Float:villAttackPlayeridDist[sizeof(VillageNpcWalk)], // Последняя дистанция от бота до атакуемого игрока
    villAttackPlayeridDistChange[sizeof(VillageNpcWalk)], // Время последнего изменения дистанции
    villDestination[sizeof(VillageNpcWalk)], // Направление прогулки бота, чтобы повторно не направлять в одну и ту-же точку
    Text3D:villEnterLabel[2], // Лейблы входов
    bool:villGiftStatus, // Статус, можно ли забирать подарки
    villCDShowGift, // Время, которое даётся на то, чтобы забрать все подарки
    villStoroji[2], // Два сторожа (DynamicActor)
    villCDFindAttack[sizeof(VillageNpcWalk)], // Кд на повторный поиск цели
    villKillPlayerid[sizeof(VillageNpcWalk)] // ID игрока, который убил этого бота
}
new VillageInfo[VILLAGEINFO];

enum e_VillageDisallowedAreas {
    Float: tdaMinX, Float: tdaMinY,
    Float: tdaMaxX, Float: tdaMaxY,
    Float: tdaZ
};
new VillageDisallowedAreas[][e_VillageDisallowedAreas] = {
    {-1485.5533, 2611.4146, -1476.3590, 2643.3020, 62.7813},
    {-1518.8458, 2579.3130, -1506.4941, 2590.5627, 61.3174},
    {-1535.4503, 2574.1230, -1526.0785, 2591.4585, 60.3348},
    {-1535.7977, 2561.6482, -1514.2610, 2567.0188, 59.0694},
    {-1485.4148, 2574.1006, -1476.1036, 2591.4539, 60.3369},
    {-1469.4817, 2610.6365, -1461.3585, 2627.6948, 62.0625},
    {-1443.4009, 2573.6643, -1434.0183, 2591.0291, 60.3398},
    {-1458.2278, 2610.7925, -1437.0350, 2622.5500, 60.7620},
    {-1535.8781, 2610.8396, -1525.9083, 2623.0354, 59.4144},
    {-1525.0355, 2610.9248, -1515.7908, 2626.3289, 59.6797},
    {-1511.7450, 2611.1848, -1506.4834, 2630.8804, 59.1197}
};

enum e_VillageDisallowedAreaPoints {
    Float: tdapX, Float: tdapY, Float: tdapZ, Float: tdapA
};
new VillageDisallowedAreaPoints[][e_VillageDisallowedAreaPoints] = {
    {-1480.0939, 2609.4419, 55.8360, 94.9602},
    {-1521.0276, 2589.0337, 55.8360, 178.1353},
    {-1523.6273, 2585.9551, 55.8360, 178.7627},
    {-1522.2646, 2570.1145, 55.8360, 272.3642},
    {-1489.3694, 2585.5232, 55.8360, 1.0383},
    {-1474.0979, 2607.8313, 55.8360, 91.1304},
    {-1430.5239, 2592.8743, 55.8360, 358.8213},
    {-1440.6439, 2609.1279, 55.8360, 94.6784},
    {-1538.8875, 2615.4846, 55.8360, 179.0050},
    {-1515.8434, 2607.0596, 55.8360, 91.0206},
    {-1504.2876, 2613.2197, 55.8360, 1.7823},
    {-1530.8459, 2524.8906, 55.8837, 1.4462}
};

new bool:Village_LoadTextDraws[MAX_REALPLAYERS]; // Отображаются ли текстдравы деревни для игрока
new PlayerText: VillageRemainsTD[MAX_REALPLAYERS][2]; // Текстдравы для игры с деревенскими
new Village_Kills[MAX_REALPLAYERS]; // Количество киллов во время битвы с деревенскими
new Village_BlockTarget[MAX_REALPLAYERS][sizeof(VillageNpcWalk)]; // Запрет на таргет игрока конкретными NPC

new Float: VillageStoroj[2][4] = {
    {-1361.6107,2642.7361,51.9239,255.6489}, // Эрни
    {-1619.9281,2685.8677,54.9776,74.5639} // Бэрни
};
