
// Джоне
new scriptCue1[][] = // Джоне начинаем квест
{
    "Здарова. Короче, мне нужна помощь", 
    "Смотри, сзади тебя стоит тачка", 
    "В ней лежит пакет, который мне нужен", 
    "Вскрой тачку и принеси мне этот пакет",
    "Отмычки возьми на столе",
    "Мне сказали ты профи, так что действуй"
};
new msCue1[] = // Джоне начинаем квест (время реплик в миллисекундах)
{
    3200,
    2900,
    1570,
    2160,
    1330,
    2800
};

new scriptCue2[][] = // Джоне завершаем квест
{
    "Отлично! На владельца этой машины мне насрать, он мне должен",
    "Поэтому можешь оставить её себе",
    "Управляй транспортом через свой смартфон",
    "Не говорю прощай, потому что мы ещё точно увидимся"
};
new msCue2[] = // Джоне завершаем квест (время реплик в миллисекундах)
{
    4200,
    2090,
    2170,
    3280
};

// Дрейк
new scriptCue3[][] = // Дрейк подходим к нему первый раз
{
    "Привет. Че? Не знаешь что делать?", 
    "Для тебя всегда найдётся интересное задание", 
    "Во первых. Тебе не нужно постоянно подходить ко мне", 
    "Просто открой свой смартфон, найди вкладку меню и зайди в раздел квесты [ Y >> Квесты  ]",
    "Выбирай любой и проходи с кайфом",
    "Но так уж и быть. Я покажу тебе задания"
};
new msCue3[] = // Дрейк подходим к нему первый раз (время реплик в миллисекундах)
{
    2400,
    2050,
    2300,
    3600,
    1500,
    2400
};

new scriptCue4[][] = // Дрейк подходим к нему в следующие разы (рандомная реплика)
{
    "Как у тебя успехи? Осваиваешься потихоньку?", 
    "Вот задания для тебя", 
    "Не забывай, что ты можешь открыть квесты в своём смартфоне [ Y >> Квесты ]"
};
new msCue4[] = // Дрейк подходим к нему в следующие разы (рандомная реплика) (время реплик в миллисекундах)
{
    2600,
    1500,
    3060
};

 // Дрейк подходим к нему в следующие разы (рандомная реплика)
new scriptCue5[][] =
{
    "Какой же ты красавец, я не могууу", 
    "Нужны задания? Держи", 
    "Не забывай, что ты можешь открыть квесты в своём смартфоне [ Y >> Квесты ]"
};
new msCue5[] =
{
    3000,
    2050,
    3060
};


// Дрейк подходим к нему в следующие разы (рандомная реплика)
new scriptCue6[][] =
{
    "Какая же ты красавица, я не могууу", 
    "Нужны задания? Держи", 
    "Не забывай, что ты можешь открыть квесты в своём смартфоне [ Y >> Квесты ]"
};
new msCue6[] =
{
    2500,
    1500,
    3060
};


// Дрейк подходим к нему в следующие разы (рандомная реплика)
new scriptCue7[][] =
{
    "Да, привет. Я ведь уже говорил как проходить квесты", 
    "Ладно, вот, смотри", 
    "Не забывай, что ты можешь открыть квесты в своём смартфоне [ Y >> Квесты ]"
};
new msCue7[] =
{
    3000,
    1300,
    3060
};


// Брюс старт археологии
new scriptCue8[][] =
{
    "Ну здарова. Да, мне сейчас нужны крепкие ребята",
    "Хоть ты и выглядишь как тряпочка половая",
    "Ладно, ладно. Не напрягайся",
    "Зайди в вагончик, купи монтировку, верёвку и лопату",
    "Нет, мы никого закапывать не будем",
    "Просто эти инструменты тебе пригодятся"
};
new msCue8[] =
{
    3340,
    2270,
    1920,
    3380,
    1840,
    2250,
};


// Брюс после покупки инстументов
new scriptCue9[][] =
{
    "Теперь подтяни подгузник и топай в гробницу",
    "Всё что там найдёшь, ты сможешь продать здесь в вагончике",
    "Я буду с тобой на связи, если что"
};
new msCue9[] = 
{
    3060,
    3170,
    2460
};


// Доктор на осмотре
new scriptCue10[][] =
{
    "Здравствуйте",
    "Ну что-же, спускайте штаны",
    "Хм... (Внимательно посмотрел)",
    "Я такое уже видел, так что не переживайте",
    "Вот вам рецепт, отправляйтесь в аптеку",
    "И купите {FF6347}Хламидиуберин",
    "Вам нужно пропить это лекарство и все будет в порядке",
    "До свидания!"
};
new msCue10[] =
{
    2000,
    2000,
    7000,
    3000,
    3000,
    4000,
    5000,
    3000
};
