
// Джоне
new scriptCue1[][] = // Джоне начинаем квест
{
    "Здарова. Короче, мне нужна помощь", 
    "Смотри, сзади тебя стоит тачка", 
    "В ней лежит пакет, который мне нужен", 
    "Вскрой тачку и принеси мне этот пакет",
    "Отмычки возьми на столе",
    "Мне сказали ты профи, так что действуй"
};
new msCue1[] = // Джоне начинаем квест (время реплик в миллисекундах)
{
    3000,
    2050,
    1370,
    1860,
    1070,
    2160
};

new scriptCue2[][] = // Джоне завершаем квест
{
    "Отлично! На владельца этой машины мне насрать, он мне должен",
    "Поэтому можешь оставить её себе",
    "Управляй транспортом через свой смартфон",
    "Не говорю прощай, потому что мы ещё точно увидимся"
};
new msCue2[] = // Джоне завершаем квест (время реплик в миллисекундах)
{
    3400,
    2030,
    2020,
    2880
};

// Дрейк
new scriptCue3[][] = // Дрейк подходим к нему первый раз
{
    "Привет. Че? Не знаешь что делать?", 
    "Для тебя всегда найдётся интересное задание", 
    "Во первых. Тебе не нужно постоянно подходить ко мне", 
    "Просто открой свой смартфон, найди вкладку меню и зайди в раздел квесты [ Y >> Квесты  ]",
    "Выбирай любой и проходи с кайфом",
    "Но так уж и быть. Я покажу тебе задания"
};
new msCue3[] = // Дрейк подходим к нему первый раз (время реплик в миллисекундах)
{
    2400,
    2050,
    2300,
    3600,
    1500,
    2400
};

new scriptCue4[][] = // Дрейк подходим к нему в следующие разы (рандомная реплика)
{
    "Как у тебя успехи? Осваиваешься потихоньку?", 
    "Вот задания для тебя", 
    "Не забывай, что ты можешь открыть квесты в своём смартфоне [ Y >> Квесты ]"
};
new msCue4[] = // Дрейк подходим к нему в следующие разы (рандомная реплика) (время реплик в миллисекундах)
{
    2600,
    1500,
    3060
};

new scriptCue5[][] = // Дрейк подходим к нему в следующие разы (рандомная реплика)
{
    "Какой же ты красавец, я не могууу", 
    "Нужны задания? Держи", 
    "Не забывай, что ты можешь открыть квесты в своём смартфоне [ Y >> Квесты ]"
};
new msCue5[] = // Дрейк подходим к нему в следующие разы (рандомная реплика) (время реплик в миллисекундах)
{
    3000,
    2050,
    3060
};

new scriptCue6[][] = // Дрейк подходим к нему в следующие разы (рандомная реплика)
{
    "Какая же ты красавица, я не могууу", 
    "Нужны задания? Держи", 
    "Не забывай, что ты можешь открыть квесты в своём смартфоне [ Y >> Квесты ]"
};
new msCue6[] = // Дрейк подходим к нему в следующие разы (рандомная реплика) (время реплик в миллисекундах)
{
    2500,
    1500,
    3060
};

new scriptCue7[][] = // Дрейк подходим к нему в следующие разы (рандомная реплика)
{
    "Да, привет. Я ведь уже говорил как проходить квесты", 
    "Ладно, вот, смотри", 
    "Не забывай, что ты можешь открыть квесты в своём смартфоне [ Y >> Квесты ]"
};
new msCue7[] = // Дрейк подходим к нему в следующие разы (рандомная реплика) (время реплик в миллисекундах)
{
    3000,
    1300,
    3060
};

new scriptCue8[][] = // Брюс старт квеста
{
    "Ну здарова. Да, мне сейчас нужны крепкие ребята",
    "Хоть ты и выглядишь как тряпочка половая",
    "Ладно, ладно. Не напрягайся",
    "Зайди в вагончик, купи монтировку, верёвку и лопату",
    "Нет, мы никого закапывать не будем",
    "Просто эти инструменты тебе пригодятся"
};

new msCue8[] = // Брюс старт квеста
{
    3000,
    1300,
    1300,
    3000,
    2000,
    1300,
};

new scriptCue9[][] = // Брюс после покупки инстументов
{
    "Теперь подтяни подгузник и топай в гробницу",
    "Всё что там найдёшь, ты сможешь продать здесь в вагончике",
    "Я буду с тобой на связи, если что"
};

new msCue9[] = // брюс после покупки инструментов
{
    3000,
    1300,
    1300
};

new scriptCue10[][] = // Брюс после покупки инстументов
{
    "Видишь вот там пиромида, дуй туда и проходи лабиринт",
    "Я понятия не имею как здесь оказались древнеегипетские пирамиды",
    "Меня даже не спрашивай"
};

new msCue10[] = // брюс после покупки инструментов
{
    3000,
    1300,
    1300
};

new scriptCue11[][] = // Брюс после покупки инстументов
{
    "Ну милок, снимайте ваши штаны.",
    "Мда... Тут все печально, вот вам рецепт, идите в аптеку и купите там Хламидиуберин"
};

new msCue11[] = // брюс после покупки инструментов
{
    3000,
    8000
};